"""Bot messages"""

MESSAGES_USER_OF_THE_DAY = [
    "🎉 Сегодня красавчик дня - ",
    "КРУТИМ БАРАБАН",
    "Ищем красавчика в этом чате",
    "Гадаем на бинарных опционах 📊",
    "Анализируем лунный гороскоп 🌖",
    "Лунная призма дай мне силу 💫",
    "СЕКТОР ПРИЗ НА БАРАБАНЕ 🎯"
]

MESSAGES_PIDOR_OF_THE_DAY = [
    "🎉 Сегодня ПИДОР 🌈 дня - ",
    "ВНИМАНИЕ 🔥",
    "ФЕДЕРАЛЬНЫЙ 🔍 РОЗЫСК ПИДОРА 🚨",
    "4 - спутник запущен 🚀",
    "3 - сводки Интерпола проверены 🚓",
    "2 - твои друзья опрошены 🙅",
    "1 - твой профиль в соцсетях проанализирован 🙀"
]

NO_PLAYERS = "Нет игроков"
ALREADY_REGISTERED = "Ты уже в игре"
REGISTRATION_SUCCESS = ", Ты в игре"
STAT_USER_HEADER = "🎉 Результаты Красавчик Дня\n"
STAT_PIDOR_HEADER = "Результаты 🌈ПИДОР Дня\n"
